In [48]:
import pandas as pd
from pathlib import Path

In [49]:
import sys
project_root = Path.cwd().parent
sys.path.append(str(project_root))

In [62]:
from src.features import add_price_per_sqft,count_by_location_sorted

In [51]:
input_path = Path('../data/interim/data_cleaning_output.parquet')
df = pd.read_parquet(input_path)

In [52]:
df.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [53]:
# let's add the column price_per_sqft
df = add_price_per_sqft(df,'price','total_sqft')
df.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [54]:
# let's clean a little bit the location column
df['location'] = df['location'].apply(lambda x: x.strip())
df.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [57]:
location_stats = count_by_location_sorted(df)
location_stats

location
AECS LAYOUT A-BLOCK Singasandra      1
AGB Layout                           1
Aavalahalli                          1
Abshot Layout                        1
Achins Road                          1
                                  ...
Thanisandra                        236
Kanakpura Road                     266
Electronic City                    304
Sarjapur  Road                     392
Whitefield                         535
Name: location, Length: 1293, dtype: int64

In [65]:
# we set a threshold, any categoty with <10 datapoints will be classed as other category
location_stats_less_than_10 = location_stats[location_stats <= 10]
location_stats_less_than_10

location
AECS LAYOUT A-BLOCK Singasandra     1
AGB Layout                          1
Aavalahalli                         1
Abshot Layout                       1
Achins Road                         1
                                   ..
Dodsworth Layout                   10
Ganga Nagar                        10
Naganathapura                      10
Sadashiva Nagar                    10
Nagadevanahalli                    10
Name: location, Length: 1052, dtype: int64

In [66]:
df.location = df.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)

In [67]:
df['location'].value_counts()

location
other                        2881
Whitefield                    535
Sarjapur  Road                392
Electronic City               304
Kanakpura Road                266
                             ...
Tindlu                         11
Marsur                         11
2nd Phase Judicial Layout      11
Thyagaraja Nagar               11
HAL 2nd Stage                  11
Name: count, Length: 242, dtype: int64

In [68]:
# exporting the dataframe
# export dataframe to feature-engineering notebook
output_path = Path('../data/interim/feature_engineering_output.parquet')
df.to_parquet(output_path)